# IFC_AddRecToObjMap

## Description
Adds Record to the mapping for an Object.

```pascal
FUNCTION IFC_AddRecToObjMap(
				objectName : STRING;
				recordName : STRING;
				condition  : STRING;
				bEnable    : BOOLEAN) : BOOLEAN;
```

```python

def vs.IFC_AddRecToObjMap(objectName, recordName, condition, bEnable):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectName|STRING||
|recordName|STRING||
|condition|STRING||
|bEnable|BOOLEAN||

## Version
Availability: from Vectorworks 2023.4
## Category
* IFC